<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"19bca1115cfbf2064ff465567322a613c03a6f5bd1374db8b4401fb295080f4a","plan_job_ref":"Job Test actions using target, replace, and exclude #23 at https://github.com/dflook/terraform-github-actions/actions/runs/20955603377","plan_out_hash":"be1cde9377467ec1a37ec95e807d0f3b3427a5ac10a8c5fce074217df84f79f5","plan_hash":"53071a2cee9f1780013eddff785a11dd0869540c9f58b224a4c654369274a178","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "ubj19QLxWY" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "mgueBoyDdQ" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #23](https://github.com/dflook/terraform-github-actions/actions/runs/20955603377)
<details open><summary>Outputs</summary>

```hcl
also_exclude = "kzl54S959j"
count        = "WiUvC6ES5o"
exclude_me   = "Xs79tXyXLK"
foreach      = "nYRG95Rtod"
keep_me      = "xc92gxmYQg"
```
</details>